// --створити масив та вивести його в консоль:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let arr = [5, 12, 16, 18, 365];
// console.log(arr);
// let arr1 = ['menoy', 'tanay', 'hand', 'leg', 'capit'];
// console.log(arr1);
// let arr2 = ['aloha', 35, false, true, 'madam', 12];
// console.log(arr2);
// let arr3 = [];
// arr3[1] = 'Vlad';
// arr3[0] = false;
// arr3[2] = 45;
// arr3[3] = ()=>{console.log('Hello')};
// arr3[4] = NaN;
// arr3[6] = true;
// console.log(arr3);

// За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// for (i = 0; i <= 10; i++) {
    // document.write(`<div>Aloha</div>`);
// };

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

// for (i = 0; i <= 10; i++) {
//     document.write(`<div>Aloha - ${i}</div>`);
// };

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

// let i = 0;
// while (i <= 20) {
//     document.write(`<h1>Privet</h1>`);
//     i++
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// let i = 0;
// while (i <= 20) {
//     document.write(`<h1>Privet - ${i}</h1>`);
//     i++
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// let arr = [5, 12, 16, 18, 365, 2.75, 3100, 25400, 1, 25, 15];
// for (i = 0; i < arr.length; i++) {
    // console.log(arr[i]);
// };

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// let arr = ['menoy', 'tanay', 'hand', 'leg', 'capit', 'yola', 'habmle', 'alala', 'Kiyv', 'laptop'];

// for (i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// };

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// let arr = [false, 10, 'Aloha', true, NaN, 'trololo', 2500, undefined, null];
// for (i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// };

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

// let arr = [false, 10, 'Aloha', true, NaN, 'trololo', 2500, undefined, null];
// for (i = 0; i <arr.length; i++) {
//     if(typeof arr[i] === 'boolean')  {
//         console.log(arr[i]);
//     }
// };

 // - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи


// for (i = 0; i < arr.length; i++) {
//     if(typeof arr[i] === 'string') {
//         console.log(arr[i]);
//     }
// };

 // - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи

// for (i = 0; i < arr.length; i++) {
//     typeof arr[i] === 'number'
//     ? console.log(arr[i])
//     : '';
// };

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

// let arr3 = [];
// arr3[1] = 'Vlad';
// arr3[0] = false;
// arr3[2] = 45;
// arr3[3] = ()=>{console.log('Hello')};
// arr3[4] = NaN;
// arr3[6] = true;
// arr3[7] = false;
// arr3[8] = 2500;
// arr3[9] = 'Privet';
// arr3[10] = 'Rakamakafo';

// for (i = 0; i < arr3.length; i++) {
//     console.log(arr3[i]);
// };

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (i = 0; i <= 10; i++) {
//     console.log(`Step - ${i}`);
//     document.write(`Step - ${i}<br>`);
// };
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (i = 0; i <= 100; i++) {
//     console.log(`Step - ${i}`);
//     document.write(`Step - ${i}<br>`);
// };
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (i = 0; i <= 100; i+=2) {
//     console.log(`Step - ${i}`);
//     document.write(`Step - ${i}<br>`);
// };

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

// for (i = 0; i <= 100; i++) {
//     if(i % 2 === 0) {
//         console.log(i);
//         document.write(`${i}<br>`);
//     };
// };

// - Створити цикл while на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

// let i = 0;
// while(i <= 100) {
//     if (i % 2 === 0) {
//         console.log(i);
//         document.write(`${i}<br>`)
//     };
//     i++;
// };

// - Створити цикл while на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write


// let i = 0;
// while(i <= 100) {
//     if (i % 2 === 1) {
//         console.log(i);
//         document.write(`${i}<br>`)
//     };
//     i++;
// };

// -Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)

// // 
// for (h = 0; h <= 0; h++) {
//     for (m = 0; m <=2; m++) {
//         if (h === 0 && m === 3) break 
//         for (s = 0; s < 60; s++) {

//             console.log(`Hour: ${h}, Min: ${m}, Sec: ${s}`);
//             if (h === 0 && m === 2 && s === 0) break
//         };

//     };

// }; 



// - Відтворити роботу годинника, відрахувавши  2 години  (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)

// for (h = 0; h <= 2; h++) {
//     for (m = 0; m < 60; m++) {
//         if (h === 2 && m === 1) break 
//         for (s = 0; s < 60; s++) {

//             console.log(`Hour: ${h}, Min: ${m}, Sec: ${s}`);
//             if (h === 2 && m === 0 && s === 0) break
//         };

//     };

// };

// Я без понятия,как это работает,но это работает.

// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// let arr = [ 'a', 'b', 'c'];
// let str ='';
// for (i = 0; i < arr.length; i++) {
//     str = str + arr[i];
// };
// console.log(str);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// let arr = [ 'a', 'b', 'c'];
// let str = '';
// let i = 0;
// while (i < arr.length) {
//     str = str + arr[i];
//     i++;
// }
// console.log(str);
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// let arr = [ 'a', 'b', 'c'];
// let str = '';
// for (value of arr) {
//     str = str + value;
// };

// console.log(str);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for in зібрати всі букви в слово.
// let arr = [ 'a', 'b', 'c'];
// let str = '';
// for (value in arr) {
//     str = str + arr[value];
// };
// console.log(str);

// =================
// =================
// =================
// =================

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

// let array = ['a', 'b', 'c'];
// for (i = 1; i <= 3; i++) {
//     array.push(i);
// };
// console.log(array);

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

// let arr = [1, 2, 3];
// for(i = 3; i > 0 ; i--) {
//     console.log(i);
// };

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

// let arr = [1, 2, 3];
// for (i = 4;i <= 6; i++) {
//     arr.push(i);
// };
// console.log(arr);

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

// let arr = [1, 2, 3];
// for (i = 6;i >= 4; i--) {
//     arr.unshift(i);
// };
// console.log(arr);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()

// let arr = ['js', 'css', 'jq'];
// let shift = arr.shift();
// console.log(shift);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()

// let arr = ['js', 'css', 'jq'];
// let pop = arr.pop();
// console.log(pop);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].

// let arr = [1, 2, 3, 4, 5];
// let slice = arr.slice(3);
// console.log(slice);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].

// let arr = [1, 2, 3, 4, 5];
// let slice = arr.slice(0,2);
// console.log(slice);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].

// let arr = [1, 2, 3, 4, 5];
// let splice = arr.splice(1,2);
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(3,0,'a', 'b', 'c');
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(1,0,'a','b');
// arr.splice(6,0,'c');
// arr.splice(8,0,'e');
// console.log(arr);

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.

// let arr = [10, 20, 35, 47,1230, 12383, 147, 30303, 1234, 4123];
// for (i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i]);
//     };
// };

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший

// let arr = [10, 20, 35, 47,1230, 12383, 147, 30303, 1234, 4123];
// let arr1 = [];

// for (i = 0; i < arr.length; i++) {
//     arr1.push(arr[i]);
// };
// console.log(arr);
// console.log(arr1);

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.

// let arr = [10, 20, 35, 47,1230, 12383, 147, 30303, 1234, 4123];
// let arr1 = [];

// for (i = 0; i < arr.length; i++) {
//     arr1[i] = arr[i];
// };
// console.log(arr1);

// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:

// 1. перебрати його циклом while

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while(i < arr.length) {
//     console.log(arr);
//     i++;
// };

// 2. перебрати його циклом for

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (i = 0; i < arr.length; i++) {
    // console.log(arr[i]);
// };

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while(i < arr.length) {
//     if(i % 2 === 1) {
//         console.log(arr[i]);
//     };
//     i++;
// };

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (i = 0; i < arr.length; i++) {
//     if (i % 2 === 1) {
//         console.log(arr[i]);
//     };
// };

// 5. перебрати циклом while та вивести  числа тільки парні  значення
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while(i < arr.length) {
//     if(arr[i] % 2 === 0) {
//         console.log(arr[i]);
//     };
//     i++;
// };
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i]);
//     };
// };
// 7. замінити кожне число кратне 3 на слово "okten"

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (i = 0;i < arr.length; i++) {
//     if (arr[i] % 3 === 0) {
//         arr[i] = 'okten';
//     };
// };
// console.log(arr);

// 8. вивести масив в зворотньому порядку.

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (i = 9; i >= 0; i--) {
//     console.log(arr[i]);
// };

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (i = 9; i >= 0; i--) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i]);
//     };
// };

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (i = arr.length;i >= 0; i--) {
//     if (arr[i] % 3 === 0) {
//         arr[i] = 'okten';
//     };
//     console.log(arr[i]);
// };

// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// let arr = [];
// for (i = 0; i <= 50; i++) {
//     if (i % 2 === 0) {
//         arr[i] = i;
//         console.log(arr[i]);
//     };
// };
// console.log(arr);
// - заповнити його 50 непарними числами за допомоги циклу.
// let arr = [];
// for (i = 0; i <= 50; i++) {
//     if (i % 2 === 1) {
//         arr[i] = i;
//         console.log(arr[i]);
//     };
// };
// console.log(arr);


// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. 

// let arr = [];
// for (i = 0; i < 10; i++) {
//     arr[i] = Math.floor((Math.random()*732-8)+8);
// };
// console.log(arr);

// 2. вывести на консоль  каждый третий елемент

// let arr = [];
// for (i = 0; i < 10; i++) {
//     arr[i] = Math.floor((Math.random()*732-8)+8);
// };

// for (i = 2; i < arr.length; i+=3) {
//     console.log(arr[i]);
// };
// console.log(arr);

// 3. вывести на консоль  каждый третий елемент
//  но при условии что его значение является парным.

// let arr = [];
// for (i = 0; i < 10; i++) {
//     arr[i] = Math.floor((Math.random()*732-8)+8);
// };

// for (i = 2; i < arr.length; i+=3) {
//     if(arr[i] % 2 === 0) {
//         console.log(arr[i]);
//     }
// };
// console.log(arr);

// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.

// let arr = [];
// let arr1 = []
// for (i = 0; i < 10; i++) {
//     arr[i] = Math.floor((Math.random()*732-8)+8);
// };

// for (i = 2; i < arr.length; i+=3) {
//     if(arr[i] % 2 === 0) {
//         arr1[i] = arr[i];
//         console.log(arr1[i]);
//     };
// };
// console.log(arr);
// console.log(arr1);

// Вывести каждый елемент массива у которого соседний с права элемент - парный

// let arr = [];
// for (i = 0; i < 10; i++) {
//     arr[i] = Math.floor((Math.random()*732-8)+8);
// };
// console.log(arr);

// for(i = 0; i < arr.length; i++) {
//     if(arr[i+1] % 2 === 0) {
//         console.log(arr[i]);
//     };
// };

// 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.

// let sum = [100,250,50,168,120,345,188].reduce((a,b) => a + b,0);
// let result = sum / [100,250,50,168,120,345,188].length;
// console.log(result);

// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.

// let arr = [];
// let arr1 =[];
// for (i = 0; i < 10; i++) {
//     arr[i] = Math.floor((Math.random()*732-8)+8);
// };

// for (i = 0; i < arr.length;i++) {
//     arr1[i] = arr[i] * 5;
// };
// console.log(arr);
// console.log(arr1);

// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
//  додати його в інший масив.

// let arr = [true, false, 'trololo', 'alala', 24, 35, NaN];
// let arr1 = [];
// for (i = 0; i < arr.length;i++) {
//     if(typeof arr[i] === 'number') {
//         console.log(arr1[i] = arr[i]);
//     };
// };


// let arr = [11, 12, 13, 14, 15, 17, 20];

// for (i = arr.length - 1; i >= 0; i--) {
//     console.log(arr[i]);
// };



















